app/controllers/api/v1/sounds_controller.rb

SELECT "sounds".* FROM "sounds"
---
  def index
    @sounds = Sound.all

INSERT INTO "sounds" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Seven Nation Army"], ["created_at", "2018-11-07 16:38:41.908587"], ["updated_at", "2018-11-07 16:38:41.908587"]]
INSERT INTO "sounds" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Lady Don't Tek No"], ["created_at", "2018-11-07 16:32:21.933196"], ["updated_at", "2018-11-07 16:32:21.933196"]]
SELECT "sounds".* FROM "sounds"
---
  def create
    @sound = Sound.create(sound_params)
    @sound.file.attach(sound_params[:file])
    # render json: {
    #   name: @sound.name,
    #   url: url_for(@sound.file)
    # }
    @sounds = Sound.all

SELECT  "sounds".* FROM "sounds" WHERE "sounds"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @sound = Sound.find(params[:id])