app/controllers/api/v1/sprites_controller.rb

SELECT "sprites".* FROM "sprites"
---
  def index
    @sprites = Sprite.all